10/data/attachments/df3e345e4722888b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_99e83886-a3a4-4e3b-8905-604275423e25</nif:username>
            <nif:friendToBeAdded>Kristin_factor_Actions_27596_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>